"""

list(s)
#Преобразует объект s в список.

l.append(x)
#Добавляет новый элемент x в конец списка l.

l.extend(t)
#Добавляет новый список t в конец списка l.

l.count(x)
#Определяет количество вхождений x в список l.

l.index(x [start [,stop]])
#Возвращает наименьшее значение индекса i, где s[i] == x. 
#Необязательные значения start и stop определяют индексы начального и конеч ого элементов диапазона, где выполняется поиск.

l.insert(i,x)
#Вставляет x в элемент с индексом i.

l.pop([i])
#Возвращает i-й элемент и удаляет его из списка. Если индекс i не указан, возвращается последний элемент.

l.remove(x)
#Отыскивает в списке s элемент со значением x и удаляет его.

l.reverse()
#Изменяет порядок следования элементов в списке l на обратный.

l.sort([key [, reverse]])
#Сортирует элементы списка l.
#key –это функция, которая вычисляет значение ключа.
#reverse –признак сортировки в обратном порядке. Аргументы key и reverse всегда должны передаваться как именованные аргументы
"""
