"""capitalize()
# Преобразует первый символ в верхний регистр.

count(sub[, start[, end]])
# Подсчитывает число вхождений заданной подстроки sub.

endswith(suffix[, start[, end]])
# Проверяет, оканчивается ли строка подстрокой suffix.

find(sub[, start[, end]])
# Отыскивает первое вхождение подстроки sub или возвращает -1.

index(sub[, start[, end]])
# Отыскивает первое вхождение подстроки sub или возбуждает исключение.

isalnum()
# Проверяет, являются ли все символы в строке алфавитно-цифровыми символами.

isalpha()
# Проверяет, являются ли все символы в строке алфавитными символами.

isdigit()
# Проверяет, являются ли все символы в строке цифровыми символами.

islower()
# Проверяет, являются ли все символы в строке символами нижнего регистра.

isspace()
# Проверяет, являются ли все символы в строке пробельными символами.

istitle()
# Проверяет, являются ли первые символы всех слов символами верхнего регистра.

isupper()
# Проверяет, являются ли все символы в строке символами верхнего регистра.

lower()
# Преобразует символы строки в нижний  регистр.

lstrip([chrs])
# Удаляет начальные пробельные символы или символы, перечисленные в аргументе chrs.

replace(old, new[, maxreplace])
# Замещает подстроку old подстрокой new.

rfind(sub[, start[, end]])
# Отыскивает последнее вхождение подстроки.

rindex(sub[, start[, end]])
# Отыскивает последнее вхождение подстроки или возбуждает исключение.

rstrip([chrs])
# Удаляет конечные пробельные символы или символы, перечисленные в аргументе chrs.

startswith(prefix[, start[, end]])
# Проверяет, начинается листрока подстрокой prefix. \

strip([chrs])
# Удаляет начальные и конечные пробельные символы  или символы, перечисленные  в аргументе chrs.

swapcase() #
Приводит символы верхнего регистра к нижнему, и наоборот.

title()
#Возвращает версию строки, в которой первые символы всех слов приведены к верхнему регистру.

upper()
#Преобразует символы строки в верхний  регистр"""
